//завдання: по заданим коефіцєнтам і правим частинам рівняння системи знайти її рішення

#include <stdio.h>
#include <Windows.h>

int main() {
    SetConsoleOutputCP(1251); //підключення української для консолі

    float a1, a2, b1, b2, c1, c2, x, y; //оголошення змінних

   //ввід і призначення значень змінним
    printf("Введіть значення коефіцієнтів:\na1 = ");          
    scanf_s("%g", &a1);

    printf("b1 = ");
    scanf_s("%g", &b1);

    printf("a2 = ");
    scanf_s("%g", &a2);

    printf("b2 = ");
    scanf_s("%g", &b2);

    printf("\nВведіть значення правих частин рівняння:\nc1 = ");
    scanf_s("%g", &c1);

    printf("c2 = ");
    scanf_s("%g", &c2);

    //обчислення
    y = (c1 * b2 - c2 * b1) / (a1 * b2 - a2 * b1);
    x = (c2 * a1 - c1 * a2) / (a1 * b2 - a2 * b1);

    //вивід
    printf("\nРезультат:\nx = %g,\ny = %g\n",y, x);
}